---
kind: method
id: M:Autodesk.Revit.DB.Structure.ConnectionInputPointInfo.#ctor(System.String,System.Int32,System.String)
source: html/899c0ac6-5eb9-370c-7947-8e3151ca7622.htm
---
# Autodesk.Revit.DB.Structure.ConnectionInputPointInfo.#ctor Method

Construct an input point info.

## Syntax (C#)
```csharp
public ConnectionInputPointInfo(
	string ptSelectionText,
	int inputMemberIndex,
	string restrictionType
)
```

## Parameters
- **ptSelectionText** (`System.String`)
- **inputMemberIndex** (`System.Int32`)
- **restrictionType** (`System.String`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null